In [1]:
import pandas as pd, numpy as np

export the movies data files

In [2]:
movies_data = pd.read_csv('data/movies_data/movies.csv', sep=',')
dates_data = pd.read_csv('data/movies_data/dates.csv', sep=',')
rate1_data = pd.read_csv('data/movies_data/ratings1.csv', sep=',')
rate2_data = pd.read_csv('data/movies_data/ratings2.csv', sep=',')

using concat method to join two tables together \
must have the same number of rows and columns

In [3]:
ratings_data = pd.concat(
    [rate1_data, rate2_data],
    ignore_index=True
)
display(ratings_data)

        userId  movieId  rating
0            1        1     4.0
1            1        3     4.0
2            1        6     4.0
3            1       47     5.0
4            1       50     5.0
...        ...      ...     ...
100832     610   166534     4.0
100833     610   168248     5.0
100834     610   168250     5.0
100835     610   168252     5.0
100836     610   170875     3.0

[100837 rows x 3 columns]

before concat - do the number of rows match?

In [4]:
print('no. of rows in ratings: ', ratings_data.shape[0])
print('no. of rows in dates: ', dates_data.shape[0])
print(ratings_data.shape[0] == dates_data.shape[0])

no. of rows in ratings:  100837
no. of rows in dates:  100836
False

difference in no. of rows

In [5]:
display(rate1_data.tail(1))
display(rate2_data.head(1))

       userId  movieId  rating
40000     274     5621     2.0

   userId  movieId  rating
0     274     5621     2.0

to delete duplicates

In [6]:
ratings_data = ratings_data.drop_duplicates(ignore_index=True)
print('no. of rows ratings: ', ratings_data.shape[0])

no. of rows ratings:  100836

concat ratings and dates by columns, not rows

In [7]:
ratings_dates_data = pd.concat([ratings_data, dates_data], axis=1)
display(ratings_dates_data.tail(7))

        userId  movieId  rating                 date
100829     610   164179     5.0  2017-05-03 21:07:11
100830     610   166528     4.0  2017-05-04 06:29:25
100831     610   166534     4.0  2017-05-03 21:53:22
100832     610   168248     5.0  2017-05-03 22:21:31
100833     610   168250     5.0  2017-05-08 19:50:47
100834     610   168252     5.0  2017-05-03 21:19:12
100835     610   170875     3.0  2017-05-03 21:20:15